Documents/ПоступлениеЗапасовУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеЗапасовУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсновныеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПлательщикНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПлательщикНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогооблажения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СистемыНалогооблажения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СистемыНалогооблажения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльИНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалогИНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПлательщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отпускная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аварийная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закупочная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеЗапасовУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
 	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки

КонецПроцедуры

// Процедура - обработчик события ПриОткрытии.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьПлательщикаНДС();
	РегистрироватьЦеныПриИзменении();
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
	Если Объект.РегистрироватьЦены = Истина Тогда
		
		Дубли = ПроверитьДублиСтрок();
		
		Если Дубли Тогда
			
			Сообщить(НСтр("ru='Запись документа отменена! Удалите дублирующиеся строки или отмените регистрацию цен.';uk='Запис документу скасований! Видаліть рядки, що дублюються, або відмініть реєстрацію цін.'"));
			Отказ = Истина;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура рассчитывает общую сумму и сумму НДС.
//
&НаКлиенте
Процедура ОбновитьПодвалФормы()

	 Объект.СуммаДокумента = Объект.Запасы.Итог("Всего")+Объект.ОсновныеУслуги.Итог("Всего")+Объект.ПрочиеУслуги.Итог("Всего");
	 Объект.СуммаДокументаНДС = Объект.Запасы.Итог("СуммаНДС")+Объект.ОсновныеУслуги.Итог("СуммаНДС")+Объект.ПрочиеУслуги.Итог("СуммаНДС");
	 
КонецПроцедуры

// Процедура подставляет основной договор контрагента.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПроверитьПлательщикаНДС();
	Объект.ДоговорКонтрагента = ПолучитьОсновнойДоговор(Объект.Контрагент);
	
КонецПроцедуры

// Получает схему налогообложения.
//
&НаСервере
Функция ПолучитьСхемуНалогообложения(Контрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлательщикНДССрезПоследних.СистемаНалогообложения
		|ИЗ
		|	РегистрСведений.ПлательщикНДС.СрезПоследних КАК ПлательщикНДССрезПоследних
		|ГДЕ
		|	ПлательщикНДССрезПоследних.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	НеПлательщик = Перечисления.СистемыНалогооблажения.НеПлательщик; 
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СистемаНалогообложения = НеПлательщик Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

КонецФункции 

// Получает цену для новых строк табличной части.
//
&НаСервере
Функция ПолучитьЦенуНаСервере(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатурыСрезПоследних.ТипЦены = &ТипЦены";

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦены", Перечисления.ТипыЦенНоменклатуры.Закупочная);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;
	КонецЦикла;

КонецФункции

// Процедура изменяет видимость элементов формы.
//
&НаКлиенте
Процедура ПроверитьПлательщикаНДС()

	Объект.ВключаетНДС = ПолучитьСхемуНалогообложения(Объект.Контрагент);
	Если Объект.ВключаетНДС Тогда
	
		Элементы.ЗапасыСтавкаНДС.Видимость = Ложь;
		Элементы.ОсновныеУслугиСтавкаНДС.Видимость = Ложь;
        Элементы.ПрочиеУслугиСтавкаНДС.Видимость = Ложь;
        Элементы.ЗапасыСуммаНДС.Видимость = Ложь;
		Элементы.ОсновныеУслугиСуммаНДС.Видимость = Ложь;
        Элементы.ПрочиеУслугиСуммаНДС.Видимость = Ложь;
		Элементы.ЗапасыЦена.Заголовок = "Цена с НДС";
		Элементы.ОсновныеУслуги.Заголовок = "Цена с НДС";
		Элементы.ПрочиеУслуги.Заголовок = "Цена с НДС";
		
	Иначе
		
		Элементы.ЗапасыСтавкаНДС.Видимость = Истина;
		Элементы.ОсновныеУслугиСтавкаНДС.Видимость = Истина;
        Элементы.ПрочиеУслугиСтавкаНДС.Видимость = Истина;
        Элементы.ЗапасыСуммаНДС.Видимость = Истина;
		Элементы.ОсновныеУслугиСуммаНДС.Видимость = Истина;
        Элементы.ПрочиеУслугиСуммаНДС.Видимость = Истина;
		Элементы.ЗапасыЦена.Заголовок = "Цена";
		Элементы.ОсновныеУслуги.Заголовок = "Цена";
		Элементы.ПрочиеУслуги.Заголовок = "Цена";
		
	КонецЕсли; 	

	ОбновитьСтроки(Объект.ВключаетНДС);
	ОбновитьПодвалФормы();
	
КонецПроцедуры 

// Процедура изменяет видимость поля типа цены.
//
&НаКлиенте
Процедура РегистрироватьЦеныПриИзменении()
	
	Если Объект.РегистрироватьЦены Тогда	
		Элементы.ТипЦены.Видимость = Истина;	
	Иначе
		Элементы.ТипЦены.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет строки табличной части при изменении контрагента.
//
&НаКлиенте
Процедура ОбновитьСтроки(ВключаетНДС)
	
	
	Для каждого Строка Из Объект.Запасы Цикл
		
		НетНДС = ПолучитьСтавкуНДСДляСравнения(Объект.ВключаетНДС, Строка.СтавкаНДС);
		
		Если НЕ Объект.ВключаетНДС И НетНДС = Ложь Тогда		 
			ДелительНДС = 5;	 
		Иначе
			ДелительНДС = 6;
		КонецЕсли;

		Если НЕ Объект.ВключаетНДС И НетНДС Тогда
			Строка.СуммаНДС = 0;
		Иначе
			Строка.СуммаНДС = Строка.Сумма/ДелительНДС;
		КонецЕсли;

	 	Строка.Всего = Строка.Сумма + ?(ВключаетНДС, 0, Строка.СуммаНДС);
	 	
	КонецЦикла;
	
	Для каждого Строка Из Объект.ОсновныеУслуги Цикл
		
		НетНДС = ПолучитьСтавкуНДСДляСравнения(Объект.ВключаетНДС, Строка.СтавкаНДС);
		
		Если НЕ Объект.ВключаетНДС И НетНДС = Ложь Тогда		 
			ДелительНДС = 5;	 
		Иначе
			ДелительНДС = 6;
		КонецЕсли;

		Если НЕ Объект.ВключаетНДС И НетНДС Тогда
			Строка.СуммаНДС = 0;
		Иначе
			Строка.СуммаНДС = Строка.Сумма/ДелительНДС;
		КонецЕсли;

	 	Строка.Всего = Строка.Сумма + ?(ВключаетНДС, 0, Строка.СуммаНДС);
	 	
	КонецЦикла;

    Для каждого Строка Из Объект.ПрочиеУслуги Цикл
		
		НетНДС = ПолучитьСтавкуНДСДляСравнения(Объект.ВключаетНДС, Строка.СтавкаНДС);
		
		Если НЕ Объект.ВключаетНДС И НетНДС = Ложь Тогда		 
			ДелительНДС = 5;	 
		Иначе
			ДелительНДС = 6;
		КонецЕсли;

		Если НЕ Объект.ВключаетНДС И НетНДС Тогда
			Строка.СуммаНДС = 0;
		Иначе
			Строка.СуммаНДС = Строка.Сумма/ДелительНДС;
		КонецЕсли;

	 	Строка.Всего = Строка.Сумма + ?(ВключаетНДС, 0, Строка.СуммаНДС);
	 	
	КонецЦикла;

КонецПроцедуры

// Получает договор по умолчания.
//
&НаСервере
Функция ПолучитьОсновнойДоговор(Контрагент)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.ДоговорПоУмолчанию КАК Договор
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Контрагент);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Договор;
	КонецЦикла;

КонецФункции 

// Функция возвращает истину, если есть дублирующиеся строки.
//
&НаСервере
Функция ПроверитьДублиСтрок()
	
	Таблица = Объект.Запасы.Выгрузить();
	ТаблицаНоменклатуры = Таблица.Скопировать(,"Номенклатура,Цена");
	Менеджер=Новый МенеджерВременныхТаблиц;
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|    ТаблицаНоменклатуры.Номенклатура,
	|    ТаблицаНоменклатуры.Цена
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|    &ТаблицаНоменклатуры КАК ТаблицаНоменклатуры";
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры",ТаблицаНоменклатуры);
	Запрос.МенеджерВременныхТаблиц=Менеджер;
	Результат=Запрос.Выполнить();
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Счетчик
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|		СУММА(1) КАК Счетчик
	|	ИЗ
	|		ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаНоменклатуры.Номенклатура) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Счетчик > 1";
	
	Результат=Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Дубли = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Дублируется строка: %Номенклатура%!';uk='Дублюється рядок: %Номенклатура%!'");
		Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "%Номенклатура%", Выборка.Номенклатура);
		Сообщение.Сообщить();
		Дубли = Истина;
		
	КонецЦикла;
		
	Возврат Дубли;
		
КонецФункции

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

// Рассчитывается сумма НДС в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	НетНДС = ПолучитьСтавкуНДСДляСравнения(Объект.ВключаетНДС, СтрокаТабличнойЧасти.СтавкаНДС);
	
	Если НЕ Объект.ВключаетНДС И НетНДС = Ложь Тогда		 
		ДелительНДС = 5;	 
	Иначе
		ДелительНДС = 6;
	КонецЕсли;
	
	Если НЕ Объект.ВключаетНДС И НетНДС Тогда
		СтрокаТабличнойЧасти.СуммаНДС = 0;
	Иначе
		СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти.Сумма/ДелительНДС;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.ВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	
КонецПроцедуры // РассчитатьСуммуНДС()

// Получает ставку НДС.
//
&НаСервере
Функция ПолучитьСтавкуНДС()
	
	Если Объект.ВключаетНДС Тогда
		Возврат Перечисления.СтавкиНДС.НДС0;
	Иначе
		Возврат Перечисления.СтавкиНДС.НДС20;
	КонецЕсли;
	
КонецФункции

// Возвращает ложь, если контрагент является плательщиком НДС 
// и в строке табличной части указана ставка НДС = 20%.
//
&НаСервере
Функция ПолучитьСтавкуНДСДляСравнения(ВключаетНДС, СтавкаНДС)
	
	Если НЕ ВключаетНДС И СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ ЗАПАСЫ

// Процедура - обработчик события ПриИзменении табличной части "Запасы".
//
&НаКлиенте
Процедура ЗапасыПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ЗапасыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ЗапасыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура ЗапасыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	ТекущиеДанные.Цена = ТекущиеДанные.Сумма/ТекущиеДанные.Количество;
	РассчитатьСуммуНДС(ТекущиеДанные);
	ОбновитьПодвалФормы();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Запасы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Цена) Тогда
	
		ТекущиеДанные.Цена = ПолучитьЦенуНаСервере(ТекущиеДанные.Номенклатура);
		РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтавкаНДС) Тогда
	
		ТекущиеДанные.СтавкаНДС = ПолучитьСтавкуНДС();
		РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");

	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ЗапасыСтавкаНДСПриИзменении(Элемент)
	
	  РассчитатьСуммуВСтрокеТабличнойЧасти("Запасы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ ОСНОВНЫЕ УСЛУГИ

// Процедура - обработчик события ПриИзменении табличной части "ОсновныеУслуги".
//
&НаКлиенте
Процедура ОсновныеУслугиПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ОсновныеУслугиКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("ОсновныеУслуги");

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ОсновныеУслугиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("ОсновныеУслуги");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура ОсновныеУслугиСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеУслуги.ТекущиеДанные;
	ТекущиеДанные.Цена = ТекущиеДанные.Сумма/ТекущиеДанные.Количество;
	РассчитатьСуммуНДС(ТекущиеДанные);
	ОбновитьПодвалФормы();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ОсновныеУслуги.
//
&НаКлиенте
Процедура ОсновныеУслугиОсновныеУслугиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеУслуги.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Цена) Тогда
	
		ТекущиеДанные.Цена = ПолучитьЦенуНаСервере(ТекущиеДанные.Номенклатура);
		РассчитатьСуммуВСтрокеТабличнойЧасти("ОсновныеУслуги");

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтавкаНДС) Тогда
	
		ТекущиеДанные.СтавкаНДС = ПолучитьСтавкуНДС();
		РассчитатьСуммуВСтрокеТабличнойЧасти("ОсновныеУслуги");

	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ОсновныеУслугиСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("ОсновныеУслуги");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ ПРОЧИЕ УСЛУГИ

// Процедура - обработчик события ПриИзменении табличной части "ПрочиеУслуги".
//
&НаКлиенте
Процедура ПрочиеУслугиПриИзменении(Элемент)
	
	ОбновитьПодвалФормы();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Количество.
//
&НаКлиенте
Процедура ПрочиеУслугиКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("ПрочиеУслуги");

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Цена.
//
&НаКлиенте
Процедура ПрочиеУслугиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("ПрочиеУслуги");

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Сумма.
//
&НаКлиенте
Процедура ПрочиеУслугиСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрочиеУслуги.ТекущиеДанные;
	ТекущиеДанные.Цена = ТекущиеДанные.Сумма/ТекущиеДанные.Количество;
	РассчитатьСуммуНДС(ТекущиеДанные);
	ОбновитьПодвалФормы();

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода ПрочиеУслуги.
//
&НаКлиенте
Процедура ПрочиеУслугиПрочиеУслугиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрочиеУслуги.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Цена) Тогда
	
		ТекущиеДанные.Цена = ПолучитьЦенуНаСервере(ТекущиеДанные.Номенклатура);
		РассчитатьСуммуВСтрокеТабличнойЧасти("ПрочиеУслуги");

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.СтавкаНДС) Тогда
	
		ТекущиеДанные.СтавкаНДС = ПолучитьСтавкуНДС();
		РассчитатьСуммуВСтрокеТабличнойЧасти("ПрочиеУслуги");

	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СтавкаНДС.
//
&НаКлиенте
Процедура ПрочиеУслугиСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти("ПрочиеУслуги");

КонецПроцедуры
